src/main/java/com/amdocs/halo/automation/xmls/EVC_Amend_1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderTrackingAndManagement.ocxGenericServices.services.amdocs.com">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken wsu:Id="UsernameToken-E9831C5131DB1C636214604451108501">
        <wsse:Username>OMS</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cus:amendProductOrderItem xmlns:tns="http://CustomerOrderTrackingAndManagement.ocxGenericServices.services.amdocs.com">
      <amendProductOrderItemRequest>
        <salesChannel>SA</salesChannel>
        <options>
          <confirmationChecksApproved>true</confirmationChecksApproved>
          <bulkOrderIndicator />
        </options>
        <order>
          <userId>hs1650</userId>
          <customer>
            <customerId>83908867321706</customerId>
            <organizationId>1115130</organizationId>
            <contractId>3305329</contractId>
            <customerName>HarmeshS</customerName>
            <saartId>SAART11040</saartId>
            <customerType>EIS</customerType>
          </customer>
          <description>Using update Add Product to offer</description>
          <productOrderItemId>{$productOrderItemId$}</productOrderItemId>
          <startOrderingProcess>true</startOrderingProcess>
          <topLevelProduct>
            <associationSpec>
              <!--productServiceId>04102025211</productServiceId-->
              <assignedProductId>{$assignProductId$}</assignedProductId>
              <!--productSpecsCode>EVCAccess</productSpecsCode-->
            </associationSpec>
            <orderItem>
              <contacts>
                <contactType>CUS</contactType>
                <email>ns1650000@amdocs.com</email>
                <firstName>Harmesh</firstName>
                <landLinePhone>9123123458</landLinePhone>
                <lastName>S</lastName>
                <mobilePhone>9856987747</mobilePhone>
              </contacts>
              <orderActionType>PR</orderActionType>
              <serviceRequiredDate>2019-10-08T20:59:59+02:00</serviceRequiredDate>
            </orderItem>
            <topLevelProduct>
              <containedProducts>
                <action>CHANGE</action>
                <associationSpecDefinition>
                  <componentServiceType>EVCA</componentServiceType>
                </associationSpecDefinition>
                <characteristicValues>
                  <characteristicDefinition>
                    <attributeCode>CIRSpeed</attributeCode>
                  </characteristicDefinition>
                  <value>50</value>
                </characteristicValues>
                <!--<characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>terminationEndPointSide</attributeCode>
                           </characteristicDefinition>
                           <value>Z</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>baseServiceType</attributeCode>
                           </characteristicDefinition>
                           <value>ASE-NOD</value>
                        </characteristicValues>
                     </containedProducts>-->
                <!--<containedProducts>
                        <action>CHANGE</action>
                        <associationSpecDefinition>
                           <componentServiceType>EVCA</componentServiceType>
                        </associationSpecDefinition>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>EVCServiceType</attributeCode>
                           </characteristicDefinition>
                           <value>SDNASE</value>
                        </characteristicValues>
                     </containedProducts>
                     <containedProducts>
                        <action>CHANGE</action>
                        <associationSpecDefinition>
                           <componentServiceType>COSD</componentServiceType>
                        </associationSpecDefinition>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>providerEdgeIngressProfileID</attributeCode>
                              <attributeId>10129</attributeId>
                           </characteristicDefinition>
                           <value>7138</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>providerEdgeEgressProfileID</attributeCode>
                              <attributeId>10119</attributeId>
                           </characteristicDefinition>
                           <value>67892</value>
                        </characteristicValues>
                     </containedProducts>
                     <containedProducts>
                        <action>CHANGE</action>
                        <associationSpecDefinition>
                           <componentServiceType>COSP</componentServiceType>
                           <componentAssignedProductId>105152601</componentAssignedProductId>
                        </associationSpecDefinition>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>CosElement</attributeCode>
                              <attributeId>86453</attributeId>
                           </characteristicDefinition>
                           <value>PE Ingress</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos3Percentage</attributeCode>
                              <attributeId>86493</attributeId>
                           </characteristicDefinition>
                           <value>48</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos4Percentage</attributeCode>
                              <attributeId>86503</attributeId>
                           </characteristicDefinition>
                           <value>58</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos1Percentage</attributeCode>
                              <attributeId>86463</attributeId>
                           </characteristicDefinition>
                           <value>68</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos2Percentage</attributeCode>
                              <attributeId>86483</attributeId>
                           </characteristicDefinition>
                           <value>78</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos2vPercentage</attributeCode>
                              <attributeId>86473</attributeId>
                           </characteristicDefinition>
                           <value>88</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos5Percentage</attributeCode>
                              <attributeId>86513</attributeId>
                           </characteristicDefinition>
                           <value>98</value>
                        </characteristicValues>
                     </containedProducts>
                     <containedProducts>
                        <action>CHANGE</action>
                        <associationSpecDefinition>
                           <componentServiceType>COSP</componentServiceType>
                           <componentAssignedProductId>105152602</componentAssignedProductId>
                        </associationSpecDefinition>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>CosElement</attributeCode>
                              <attributeId>86453</attributeId>
                           </characteristicDefinition>
                           <value>PE Egress</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos3Percentage</attributeCode>
                              <attributeId>86493</attributeId>
                           </characteristicDefinition>
                           <value>13</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos4Percentage</attributeCode>
                              <attributeId>86503</attributeId>
                           </characteristicDefinition>
                           <value>14</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos1Percentage</attributeCode>
                              <attributeId>86463</attributeId>
                           </characteristicDefinition>
                           <value>15</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos2Percentage</attributeCode>
                              <attributeId>86483</attributeId>
                           </characteristicDefinition>
                           <value>16</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos2vPercentage</attributeCode>
                              <attributeId>86473</attributeId>
                           </characteristicDefinition>
                           <value>17</value>
                        </characteristicValues>
                        <characteristicValues>
                           <characteristicDefinition>
                              <attributeCode>Cos5Percentage</attributeCode>
                              <attributeId>86513</attributeId>
                           </characteristicDefinition>
                           <value>18</value>
                        </characteristicValues>-->
              </containedProducts>
            </topLevelProduct>
          </topLevelProduct>
        </order>
      </amendProductOrderItemRequest>
    </cus:amendProductOrderItem>
  </soapenv:Body>
</soapenv:Envelope>